/*
 *  _______     ________    ________    ________    __
 * |   __  \   |__    __|  |   _____|  |   _____|  |  |
 * |  |  |  |     |  |     |  |        |  |_____   |  |
 * |  |  |  |     |  |     |  |        |   _____|  |__|
 * |  |__|  |   __|  |__   |  |_____   |  |_____    __
 * |_______/   |________|  |________|  |________|  |__|
 *
 * Dice! QQ Dice Robot for TRPG
 * Copyright (C) 2018-2019 w4123溯洄
 *
 * This program is free software: you can redistribute it and/or modify it under the terms
 * of the GNU Affero General Public License as published by the Free Software Foundation,
 * either version 3 of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
 * without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU Affero General Public License for more details.
 *
 * You should have received a copy of the GNU Affero General Public License along with this
 * program. If not, see <http://www.gnu.org/licenses/>.
 */
#include "CQEVE_ALL.h"
#include "CQTools.h"
#include <cctype>
#include <sstream>
#include "RD.h"
#include "RDConstant.h"
#include "MsgFormat.h"
using namespace std;
using namespace CQ;

inline void init(string &msg)
{
	msg_decode(msg);
}

inline void init2(string &msg)
{
	for (int i = 0; i != msg.length(); i++)
	{
		if (msg[i] < 0)
		{
			if ((msg[i] & 0xff) == 0xa1 && (msg[i + 1] & 0xff) == 0xa1)
			{
				msg[i] = 0x20;
				msg.erase(msg.begin() + i + 1);
			}
			else if ((msg[i] & 0xff) == 0xa3 && (msg[i + 1] & 0xff) >= 0xa1 && (msg[i + 1] & 0xff) <= 0xfe)
			{
				msg[i] = msg[i + 1] - 0x80;
				msg.erase(msg.begin() + i + 1);
			}
			else
			{
				i++;
			}
		}
	}

	while (isspace(static_cast<unsigned char>(msg[0])))
		msg.erase(msg.begin());
	while (!msg.empty() && isspace(static_cast<unsigned char>(msg[msg.length() - 1])))
		msg.erase(msg.end() - 1);
	if (msg.substr(0, 2) == "。")
	{
		msg.erase(msg.begin());
		msg[0] = '.';
	}
	if (msg[0] == '!')
		msg[0] = '.';
}

inline void COC7D(string &strMAns)
{
	RD rd3D6("3D6");
	RD rd2D6p6("2D6+6");
	strMAns += "的人物作成:";
	strMAns += '\n';
	strMAns += "力量STR=3D6*5=";
	rd3D6.Roll();
	const int STR = rd3D6.intTotal * 5;

	strMAns += to_string(STR) + "/" + to_string(STR / 2) + "/" + to_string(STR / 5);
	strMAns += '\n';
	strMAns += "体质CON=3D6*5=";
	rd3D6.Roll();
	const int CON = rd3D6.intTotal * 5;

	strMAns += to_string(CON) + "/" + to_string(CON / 2) + "/" + to_string(CON / 5);
	strMAns += '\n';
	strMAns += "体型SIZ=(2D6+6)*5=";
	rd2D6p6.Roll();
	const int SIZ = rd2D6p6.intTotal * 5;

	strMAns += to_string(SIZ) + "/" + to_string(SIZ / 2) + "/" + to_string(SIZ / 5);
	strMAns += '\n';
	strMAns += "敏捷DEX=3D6*5=";
	rd3D6.Roll();
	const int DEX = rd3D6.intTotal * 5;

	strMAns += to_string(DEX) + "/" + to_string(DEX / 2) + "/" + to_string(DEX / 5);
	strMAns += '\n';
	strMAns += "外貌APP=3D6*5=";
	rd3D6.Roll();
	const int APP = rd3D6.intTotal * 5;

	strMAns += to_string(APP) + "/" + to_string(APP / 2) + "/" + to_string(APP / 5);
	strMAns += '\n';
	strMAns += "智力INT=(2D6+6)*5=";
	rd2D6p6.Roll();
	const int INT = rd2D6p6.intTotal * 5;

	strMAns += to_string(INT) + "/" + to_string(INT / 2) + "/" + to_string(INT / 5);
	strMAns += '\n';
	strMAns += "意志POW=3D6*5=";
	rd3D6.Roll();
	const int POW = rd3D6.intTotal * 5;

	strMAns += to_string(POW) + "/" + to_string(POW / 2) + "/" + to_string(POW / 5);
	strMAns += '\n';
	strMAns += "教育EDU=(2D6+6)*5=";
	rd2D6p6.Roll();
	const int EDU = rd2D6p6.intTotal * 5;

	strMAns += to_string(EDU) + "/" + to_string(EDU / 2) + "/" + to_string(EDU / 5);
	strMAns += '\n';
	strMAns += "幸运LUCK=3D6*5=";
	rd3D6.Roll();
	const int LUCK = rd3D6.intTotal * 5;
	strMAns += to_string(LUCK);

	strMAns += '\n';
	strMAns += "共计:" + to_string(STR + CON + SIZ + APP + POW + EDU + DEX + INT + LUCK);

	strMAns += "\n理智SAN=POW=";
	const int SAN = POW;
	strMAns += to_string(SAN);
	strMAns += "\n生命值HP=(SIZ+CON)/10=";
	const int HP = (SIZ + CON) / 10;
	strMAns += to_string(HP);
	strMAns += "\n魔法值MP=POW/5=";
	const int MP = POW / 5;
	strMAns += to_string(MP);
	string DB;
	int build;
	if (STR + SIZ >= 2 && STR + SIZ <= 64)
	{
		DB = "-2";
		build = -2;
	}
	else if (STR + SIZ >= 65 && STR + SIZ <= 84)
	{
		DB = "-1";
		build = -1;
	}
	else if (STR + SIZ >= 85 && STR + SIZ <= 124)
	{
		DB = "0";
		build = 0;
	}
	else if (STR + SIZ >= 125 && STR + SIZ <= 164)
	{
		DB = "1D4";
		build = 1;
	}
	else if (STR + SIZ >= 165 && STR + SIZ <= 204)
	{
		DB = "1d6";
		build = 2;
	}
	else
	{
		DB = "计算错误!";
		build = -10;
	}
	strMAns += "\n伤害奖励DB=" + DB + "\n体格=" + (build == -10 ? "计算错误" : to_string(build));
	int MOV;
	if (DEX < SIZ && STR < SIZ)
		MOV = 7;
	else if (DEX > SIZ && STR > SIZ)
		MOV = 9;
	else
		MOV = 8;
	strMAns += "\n移动力MOV=" + to_string(MOV);
}

inline void COC6D(string &strMAns)
{
	RD rd3D6("3D6");
	RD rd2D6p6("2D6+6");
	RD rd3D6p3("3D6+3");
	strMAns += "的人物作成:";
	strMAns += '\n';
	strMAns += "力量STR=3D6=";
	rd3D6.Roll();
	const int STR = rd3D6.intTotal;

	strMAns += to_string(STR);
	strMAns += '\n';
	strMAns += "体质CON=3D6=";
	rd3D6.Roll();
	const int CON = rd3D6.intTotal;

	strMAns += to_string(CON);
	strMAns += '\n';
	strMAns += "体型SIZ=2D6+6=";
	rd2D6p6.Roll();
	const int SIZ = rd2D6p6.intTotal;

	strMAns += to_string(SIZ);
	strMAns += '\n';
	strMAns += "敏捷DEX=3D6=";
	rd3D6.Roll();
	const int DEX = rd3D6.intTotal;

	strMAns += to_string(DEX);
	strMAns += '\n';
	strMAns += "外貌APP=3D6=";
	rd3D6.Roll();
	const int APP = rd3D6.intTotal;

	strMAns += to_string(APP);
	strMAns += '\n';
	strMAns += "智力INT=2D6+6=";
	rd2D6p6.Roll();
	const int INT = rd2D6p6.intTotal;

	strMAns += to_string(INT);
	strMAns += '\n';
	strMAns += "意志POW=3D6=";
	rd3D6.Roll();
	const int POW = rd3D6.intTotal;

	strMAns += to_string(POW);
	strMAns += '\n';
	strMAns += "教育EDU=3D6+3=";
	rd3D6p3.Roll();
	const int EDU = rd3D6p3.intTotal;

	strMAns += to_string(EDU);
	strMAns += '\n';
	strMAns += "共计:" + to_string(STR + CON + SIZ + APP + POW + EDU + DEX + INT);
	const int SAN = POW * 5;
	const int IDEA = INT * 5;
	const int LUCK = POW * 5;
	const int KNOW = EDU * 5;
	const int HP = static_cast<int>(ceil(static_cast<double>(CON + SIZ) / 2.0));
	const int MP = POW;
	strMAns += "\n理智SAN=POW*5=" + to_string(SAN) + "\n灵感IDEA=INT*5=" + to_string(IDEA) + "\n幸运LUCK=POW*5=" +
			   to_string(LUCK) + "\n知识KNOW=EDU*5=" + to_string(KNOW);
	strMAns += "\n生命值HP=(CON+SIZ)/2=" + to_string(HP) + "\n魔法值MP=POW=" + to_string(MP);
	strMAns += "\n伤害奖励DB=";
	string DB;
	if (STR + SIZ >= 2 && STR + SIZ <= 12)
	{
		DB = "-1D6";
	}
	else if (STR + SIZ >= 13 && STR + SIZ <= 16)
	{
		DB = "-1D4";
	}
	else if (STR + SIZ >= 17 && STR + SIZ <= 24)
	{
		DB = "0";
	}
	else if (STR + SIZ >= 25 && STR + SIZ <= 32)
	{
		DB = "1D4";
	}
	else if (STR + SIZ >= 33 && STR + SIZ <= 40)
	{
		DB = "1D6";
	}
	else
	{
		DB = "计算错误!";
	}
	strMAns += DB;
}

inline void COC7(string &strMAns, int intNum)
{
	strMAns += "的人物作成:";
	string strProperty[] = {"力量", "体质", "体型", "敏捷", "外貌", "智力", "意志", "教育", "幸运"};
	string strRoll[] = {"3D6", "3D6", "2D6+6", "3D6", "3D6", "2D6+6", "3D6", "2D6+6", "3D6"};
	int intAllTotal = 0;
	while (intNum--)
	{
		strMAns += '\n';
		for (int i = 0; i != 9; i++)
		{
			RD rdCOC(strRoll[i]);
			rdCOC.Roll();
			strMAns += strProperty[i] + ":" + to_string(rdCOC.intTotal * 5) + " ";
			intAllTotal += rdCOC.intTotal * 5;
		}
		strMAns += "共计:" + to_string(intAllTotal);
		intAllTotal = 0;
	}
}

inline void CAT7(string &strMAns, int intNum)
{
	strMAns += "的猫咪作成:";
	string strProperty[] = {"力量", "体质", "智力", "敏捷", "教育", "外貌", "意志"};
	string strRoll[] = {"1D3", "2D6", "2D6+6", "2D6+14", "3D6+3", "3D6", "2D6+6"};
	int intAllTotal = 0;
	while (intNum--)
	{
		strMAns += '\n';
		for (int i = 0; i != 7; i++)
		{
			RD rdCOC(strRoll[i]);
			rdCOC.Roll();
			strMAns += strProperty[i] + ":" + to_string(rdCOC.intTotal * 5) + " ";
			intAllTotal += rdCOC.intTotal * 5;
		}
		strMAns += "共计:" + to_string(intAllTotal);
		intAllTotal = 0;
	}
}



inline void BG(string &strBG)
{
	strBG = "自动背景生成:\n";
	string Info[]={"结实的","英俊的","笨拙的","机灵的","迷人的","娃娃脸","聪明的","邋遢的","死人脸","肮脏的","耀眼的","书呆子","年轻的","疲倦脸","肥胖的","啤酒肚","长头发","苗条的","优雅的","稀烂的","矮壮的","苍白的","阴沉的","平庸的","乐观的","棕褐色","皱纹人","古板的","狐臭的","狡猾的","健壮的","娇俏的","筋肉人","魁梧的","迟钝的","虚弱的"};
    string Persuasion[]={"１：你信仰并祈并一位大能。（例如毗沙门天、耶稣基督、海尔·塞拉西一世）","２：人类无需上帝。（例如坚定的无神论者，人文主义者，世俗主义者）","３：科学万能！科学万岁！你将选择其中之一。（例如进化论，低温学，太空探索）","４：命中注定。（例如因果报应，种姓系统，超自然存在）","５：社团或秘密结社的一员。（例如共济会，女协，匿名者）","６：社会坏掉了，而你将成为正义的伙伴。应斩除之物是？（例如毒品，暴力，种族歧视）","７：神秘依然在。（例如占星术，招魂术，塔罗）","８：诸君，我喜欢政治。（例如保守党，共产党，自由党）","９：“金钱就是力量，我的朋友，我将竭尽全力获取我能看到的一切。”（例如贪婪心，进取心，冷酷心）","１０：竞选者/激进主义者。（例如女权运动人，平等主义家，工会权柄）"};
    string ImportantPersonr[] = {"１：父辈。（例如母亲，父亲，继母）","２：祖父辈。（例如外祖母，祖父）","３：兄弟。（例如妹妹，半血亲妹妹，无血缘妹妹）","４：孩子。（儿子或女儿）","５：另一半。（例如配偶，未婚夫，爱人）","６那位指引你人生技能的人。指明该技能和该人。（例如学校教师，师傅，父亲）","７：青梅竹马。（例如同学，邻居，幼驯染）","８：名人。偶像或者英雄。当然也许你从未见过他。（例如电影明星，政治家，音乐家。）","９：游戏中的另一位调查员伙伴。随机或自选。","１０：游戏中另一外ＮＰＣ。详情咨询你的守秘人"};
    string ImportantPersonrInfo[] = {"１：你欠了他们人情。他们帮助了你什么？（例如，经济上，困难时期的庇护，给你第一份工作）","２：他们教会了你一些东西。（例如，技能，如何去爱，如何成为男子汉）","３：他们给了你生命的意义。（例如，你渴望成为他们那样的人，你苦苦追寻着他们，你想让他们高兴）","４：你曾害了他们，而现在寻求救赎。例如，偷窃了他们的钱财，向警方报告了他们的行踪，在他们绝望时拒绝救助）","５：同甘共苦。（例如，你们共同经历过困难时期，你们携手成长，共同度过战争）","６：你想向他们证明自己。（例如，自己找到工作，自己搞到老婆，自己考到学历）","７：你崇拜他们。（例如，崇拜他们的名头，他们的魅力，他们的工作）","８：后悔的感觉。（例如，你本应死在他们面前，你背弃了你的誓言，你在可以助人之时驻足不前）","９：你试图证明你比他们更出色。他们的缺点是？（例如，懒惰，酗酒，冷漠）","１０：他们扰乱了你的人生，而你寻求复仇。发生了什么？（例如，射杀爱人之日，国破家亡之时，明镜两分之际）"};
    string ImportantMap[] = {"１：你最爱的学府。（例如，中学，大学）","２：你的故乡。（例如，乡下老家，小镇村，大都市）","３：相识初恋之处。（例如，音乐会，度假村，核弹避难所）","４：静思之地。（例如，图书馆，你的乡土别墅，钓鱼中）","５：社交之地。（例如，绅士俱乐部，地方酒吧，叔叔的家）","６：联系你思想/信念的场所。（例如，小教堂，麦加，巨石阵）","７：重要之人的坟墓。（例如，另一半，孩子，爱人）","８：家族所在。（例如，乡下小屋，租屋，幼年的孤儿院）","９：生命中最高兴时的所在。（例如，初吻时坐着的公园长椅，你的大学）","１０：工作地点。（例如，办公室，图书馆，银行）"};
    string Precious[] = {"１：与你得意技相关之物。（例如华服，假ＩＤ卡，青铜指虎）","２：职业必需品。（例如医疗包，汽车，撬锁器）","３：童年的遗留物。（例如漫画书，随身小刀，幸运币）","４：逝者遗物。（例如烛堡，钱包里的遗照，信）","５：重要之人给予之物。（例如戒指，日志，地图）","６：收藏品。（例如撤票，标本，记录）","７：你发掘而不知真相的东西。答案追寻中。（例如，橱柜里找到的未知语言信件，一根奇怪的从父亲处继承来的来源不明的风琴，花园里挖出来的奇妙的银球）","８：体育用品。（例如，球棒，签名棒球，鱼竿）","９：武器。（例如，半自动左轮，老旧的猎用来福，靴刃）","１０：宠物。（例如狗，猫，乌龟）"};
    string speciality[] = {"１：慷慨大方。（例如，小费大手，及时雨，慈善家）","２：善待动物。（例如，爱猫人士，农场出生，与马同舞）","３：梦想家。（例如，惯常异想天开，预言家，创造者）","４：享乐主义者。（例如，派对大师，酒吧醉汉，“放纵到死”）","５：赌徒，冒险家。（例如，扑克脸，任何事都来一遍，活在生死边缘）","６：好厨子，好吃货。（例如，烤得一手好蛋糕，无米之炊都能做好，优雅的食神）","７：女人缘/万人迷。（例如，长袖善舞，甜言蜜语，电眼乱放）","８：忠心在我。（例如，背负自己的朋友，从未破誓，为信念而死）","９：好名头。（例如，村里最好的饭后聊天人士，虔信圣徒，不惧任何危险）","１０：雄心壮志。（例如，梦想远大，目标是成为ＢＯＳＳ，渴求一切）"};

	RD rdInfo("1D36");
	rdInfo.Roll();
	strBG += "个人描述: " + Info[rdInfo.intTotal - 1] + "\n";
	RD rdPersuasion("1D10");
	rdPersuasion.Roll();
	strBG += "思想信念: " + Persuasion[rdPersuasion.intTotal - 1] + "\n";
	RD rdImportantPersonr("1D10");
	rdImportantPersonr.Roll();
	strBG += "重要之人: " + ImportantPersonr[rdImportantPersonr.intTotal - 1] + "\n";
	RD rdImportantPersonrInfo("1D10");
	rdImportantPersonrInfo.Roll();
	strBG += "重要之人理由: " + ImportantPersonrInfo[rdImportantPersonrInfo.intTotal - 1] + "\n";
	RD rdImportantMap("1D10");
	rdImportantMap.Roll();
	strBG += "意义非凡之地: " + ImportantMap[rdImportantMap.intTotal - 1] + "\n";

    RD rdPrecious("1D10");
	rdPrecious.Roll();
	strBG += "宝贵之物: " + Precious[rdPrecious.intTotal - 1] + "\n";
    RD rdspeciality("1D10");
	rdspeciality.Roll();
	strBG += "调查员特点: " + speciality[rdspeciality.intTotal - 1] + "\n";
	strBG += "既然决定了背景，就一定要好好扮演不要出戏哦！";
}

inline void BGC(string &strBG)
{
	strBG = "自动背景生成:\n";
	string Persuasion[] = {"神在看着窝，窝不能做坏事", "窝敬仰神，但窝危难的时候从没有什么神来救过窝，所以窝只信任窝自己", "窝要弥补窝之前的过错，无论付出什么代价", "正义就是窝毕生的追求", "万事皆虚，万事皆允", "窝绝不会让那些讨厌鬼好过", "窝热爱窝的朋友如同热爱窝自己", "窝就是喜欢和人吵一架", "啊，窝的指甲又长长了"};
	string ImportantPersonr[] = {"父母", "子女", "情人", "妻子", "朋友", "同学", "长辈", "兄弟姐妹", "兄弟连/义结金兰", "仇人"};
	string Precious[] = {"饰品", "小型武器", "小型物品如钥匙等", "吃饭的家伙事", "宅子等大型物品"};
	string speciality[] = {"沉稳冷静", "热情似火", "外冷内热", "外热内冷", "衣冠禽兽", "懒得动脑", "总爱多想", "尖酸刻薄", "踏实肯干", "生死无畏", "友谊重过生命", "真相重过生命"};
	string secret[] = {"曾经做过恶人", "从事过不正当不光彩的职业", "有痛苦回忆", "身份低微", "生理存在问题(如身上有伤疤或其它奇怪的生理问题）"};

	RD rdPersuasion("1D9");
	rdPersuasion.Roll();
	strBG += "思想与信念: " + Persuasion[rdPersuasion.intTotal - 1] + "\n";
	RD rdImportantPersonr("1D10");
	rdImportantPersonr.Roll();
	strBG += "重要之人: " + ImportantPersonr[rdImportantPersonr.intTotal - 1] + "\n";
	RD rdPrecious("1D5");
	rdPrecious.Roll();
	strBG += "宝贵之物: " + Precious[rdPrecious.intTotal - 1] + "\n";
	RD rdspeciality("1D12");
	rdspeciality.Roll();
	strBG += "特质: " + speciality[rdspeciality.intTotal - 1] + "\n";
	RD rdsecret("1D5");
	rdsecret.Roll();
	strBG += "难言之隐: " + secret[rdsecret.intTotal - 1] + "\n";
	strBG += "既然决定了背景，就一定要好好扮演不要出戏哦！";
}

inline void NPCGroup(string &strNPCGroup)
{
	string GenderInfo = "";
	strNPCGroup += "   自动生成NPC:\n";
	string Gender[] = {"男", "男", "女", "女"};
	string Age[] = {"大概10多岁", "大概20多岁", "大概20多岁", "大概30多岁", "大概30多岁", "大概20多岁", "大概20多岁", "大概30多岁", "大概30多岁", "大概40多岁", "大概50多岁", "大概60多岁"};
	string HairColor[] = {"黑色", "白金色", "金色", "棕色"};
	string HairLengthWomen[] = {"及腰长发", "齐耳短发", "到肩膀的短发", "到耳边的短发", "单马尾", "双马尾", "及腰长发", "及腰长发"};
	string HairLengthMan[] = {"飞机头", "光头", "短发", "短发", "短发", "长发"};
	string EyeShape[] = {"眯眯眼(此项则看不到眼睛颜色,刚才提到的信息忽略)", "桃花眼", "牛眼", "小眼睛", "很普通的眼睛", "很普通的眼睛"};
	string EyeColor[] = {"蓝色", "黑色", "绿色", "棕色"};
	string SkinColor[] = {"很是黝黑", "非常白皙", "非常白皙", "是健康的小麦色", "似乎刚运动完有些发红", "有些暗黄"};
	string Shape[] = {"胖", "壮硕", "干瘦", "高挑", "高挑", "矮", "普通", "普通", "矮", "普通"};
	string Temperament[] = {"很有正义感", "不太像个好人", "值得信任", "很吝啬刻薄", "非常暴躁", "有点阴郁", "和最常见的普通人一样", "和最常见的普通人一样"};

	RD rdGender("1D4");
	rdGender.Roll();
	strNPCGroup += "这是个" + Gender[rdGender.intTotal - 1] + "人,";
	if (Gender[rdGender.intTotal - 1] == "男")
	{
		GenderInfo = "他";
	}
	else
	{
		GenderInfo = "她";
	}
	RD rdAge("1D12");
	rdAge.Roll();
	strNPCGroup += GenderInfo + "看起来" + Age[rdAge.intTotal - 1] + "的年纪,";
	RD rdHairColor("1D4");
	rdHairColor.Roll();
	if (Gender[rdGender.intTotal - 1] == "男")
	{
		RD rdHairLengthMan("1D6");
		rdHairLengthMan.Roll();
		if (HairLengthMan[rdHairLengthMan.intTotal - 1] != "光头")
		{
			strNPCGroup += "有着一头" + HairColor[rdHairColor.intTotal - 1] + "的";
		}
		strNPCGroup += HairLengthMan[rdHairLengthMan.intTotal - 1] + "\n";
	}
	else
	{
		RD rdHairLengthWomen("1D9");
		rdHairLengthWomen.Roll();
		strNPCGroup += HairLengthWomen[rdHairLengthWomen.intTotal - 1] + "\n";
	}
	RD rdSkinColor("1D6");
	rdSkinColor.Roll();
	strNPCGroup += GenderInfo + "的皮肤" + SkinColor[rdSkinColor.intTotal - 1] + ",";
	RD rdShape("1D10");
	rdShape.Roll();
	strNPCGroup += "并且看起来身形比较" + Shape[rdShape.intTotal - 1] + "，";
	RD rdEyeColor("1D4");
	rdEyeColor.Roll();
	strNPCGroup += "此外还有一个" + EyeColor[rdEyeColor.intTotal - 1] + "的";
	RD rdEyeShape("1D6");
	rdEyeShape.Roll();
	strNPCGroup += EyeShape[rdEyeShape.intTotal - 1] + "\n";
	RD rdTemperament("1D8");
	rdTemperament.Roll();
	strNPCGroup += "你只是简单的看了" + GenderInfo + "一眼，就觉得这个人" + Temperament[rdTemperament.intTotal - 1] + "。\n\n";
	strNPCGroup += "以上NPC信息属于方便KP的提示，KP可以随意更改，最终以KP的决定为准";
}

inline void NPCKP(string &strNPCKP)
{
	strNPCKP = "NPC的姓名为: " + strNPCKP + ",";
	strNPCKP += "   以下是刚才自动生成的NPC的隐蔽设定:\n";
	string Character[] = {"正直:友善和正义条件下,会知无不言并主动协助。当对立和邪恶情况下,会无视生命危险拒绝提供帮助","警惕:会要求别人证明自己的身份,在确认之前不会暴露太多信息","阴谋论者:在调查员表现出对此人物生活的兴趣后表现出强烈的敌意,并有1D10=1的几率报警","多疑:心理学时会尝试对抗","愚蠢马虎:会把自己猜测的事情当真的说出来,即使猜错了也不会被心理学检测出","市侩:只会被金钱,暴力贿赂","刚正:对金钱、暴力极端排斥。但对动之以情晓之以理会很快软化","爱说:会主动和调查员说起一些相干或不相干的事情","善妒:在面对app高于80或信用等级高于70的PC时会怀有天然恶意","多情:面对app高于60的异性PC时会怀有天然好感","好色:只会和异性说话,且除魅惑外所有社交技能上升一个难度等级。当使用的PC外貌高于60时,魅惑+1奖励投,每继续增高10点增加1奖励投","城府:每3个问题会选择一个说谎,并且需要困难心理学检定才可发现","锱铢:你先回答他一个问题,他才会回答你一个问题,而且回答得总是很模糊,但可信度毫无问题","热血：豪不吝啬给予你帮助,但当会将你引向危险时也不会当回事"};
	string Manner[] = {"着急:会在1D5个问题后强行离开","悠闲:一直回答问题,并会在调查员不知道问什么事主动谈起见闻","玩味:旁敲侧击的反问调查员的情况,注意这种出发点是恶意的","好奇:反问对方为什么这么问等等,注意这种出发点不是恶意的","需要帮助:可能会提前强制将PC导入一条支线","烦躁:故意给出错误答案,这会被心理学检测出"};
	string Clothing[] = {"严肃", "休闲", "严肃", "休闲", "邋遢"};

	RD rdCharacter("1D14");
	rdCharacter.Roll();
	strNPCKP += "NPC的实际性格设定是:        " + Character[rdCharacter.intTotal - 1] + "\n";
	RD rdManner("1D6");
	rdManner.Roll();
	strNPCKP += "NPC的当前状态是:        " + Manner[rdManner.intTotal - 1] + "\n";
	RD rdClothing("1D5");
	rdClothing.Roll();
	strNPCKP += "NPC目前的衣着风格是:        " + Clothing[rdClothing.intTotal - 1] + "\n\n";
	strNPCKP += "以上信息,KP可以把性格设定(冒号前的内容)告知PC，但后续人设你自己知道就好，可以自己选择是否使用或更改";
}

inline void GAS(string &strGAS)
{
	strGAS += "  自动生成煤气灯特质:\n";
string GasString[6][20] = {{"任意选择一个有(D)记号的特征。","高龄(D):年龄追加[(1D3+1)*10]岁,参照6版标准规则,超过30岁后开始获得EDU加值,40岁以后开始对于身体属性造成减值。","优雅的岁数: 40岁开始对身体能力造成减值的规则改为从50岁开始。","白化病患者(D):STR,CON,SIZ,DEX,POW,APP中的任意一项减少15点。在明亮阳光下时[侦察]技能值减少[1D4-1]*5%点,长时间受到光照的话会受到1点以上的HP伤害。白化病人在人群中很显眼并可能被他人用有色目光看待.","酒精中毒(D):CON-5。STR,DEX,POW,APP中任意一项减少5点。为了避免陷入酩酊大醉需要通过一个SANCHECK。陷入疯狂的情况下,调查员可能会寻求酒精来逃避现实。","警戒:不易被惊吓到。潜行时一直都保持着能够随时[侦察]或者[聆听]的状态。","同盟者:投掷一个D100来决定同盟的力量/数量和出现的频率(D100的出点越大可能能够获得越有利的同盟)。用途不限。","双手灵活:调查员可以灵活的使用他的任意一只手而不会受到非惯用手的惩罚。","讨厌动物(D):技能和动物有关时技能成功率减少[1D6*5]点。","艺术天才:音乐,写作之类的艺术技能增加[INT]%。","运动:运动系技能获得加值=选择一个技能+30%,或者选择两个技能各+20%,或者选择三个技能各+10%。","夜视强化:日落西山后视觉相关惩罚只有常人的一半。","累赘(D):调查员出生于世家但是却没能达到家人的期待,或者不服管教。对于交涉系技能可能会造成影响而减少[1D3*10]%。","领导者资质:POW+1D2*5,交涉系技能+[INT]%。","打斗者:[拳击]或者[擒拿]+[1D4*5]%,每回合可以进行两次[拳击]或者[擒拿],攻击成功时+1点伤害。","笨拙(D):大失败的几率变成通常的2倍,并且大失败时可能会招致灾难。","收藏家:调查员有收集硬币,书,昆虫,艺术作品,宝石,古董之类的爱好。","身体障碍(D):失去了身体的一部分。投掷一个D6。1~2=脚,3~4=手,5=头部(投掷D6,1~3=眼睛,4~6=耳朵),6=玩家自己选择。失去脚的话DEX-15，STR或者CON-5,MOVE只有常人的一半,所有运动系技能-25%。失去手腕的话STR-5,DEX-10,所有的操作系技能-15%,使用武器会受到限制。失去眼睛的话[侦察]和火器技能等全部-35%,另外投掷一个[幸运],失败的话APP-1D2*5。失去耳朵的话APP-1D3*5,[聆听]等和耳朵有关的技能全部-30%。","再投掷三次,由玩家选择其中一个作为特征。","再投掷三次,玩家和KP各选择一个特征。"},
										{"再投掷一次,获得那个特征:特征具有(D)时,玩家可以再额外选择一个其他任意特征获得。特征没有(D)时,玩家必须再同时选择一个(D)特征。","诅咒(D):调查员被吉普赛人,魔女,法师,外国原住民等施予了诅咒,诅咒效果等同[邪眼]咒文或者由KP决定。KP也可以决定解除诅咒的条件。","黑暗先祖(D):调查员具有邪恶的一族,外国人,食人族,甚至神话生物的血统。投掷一个D100,出点越大,血统也越可怖。","听觉障碍(D):[聆听]减少[1D4*5]%。","绝症缠身(D):调查员身患绝症[癌症,失明,梅毒,结核等],绝症对调查员造成恶劣影响,至少也失去了5点CON,如果病情继续恶化的话还会继续失去其他能力值。投掷一个D100来决定剩余寿命,出点越大寿命越长。","钟楼怪人:调查员具有巨大的伤痕或者身体变形等特征,对APP造成至少减少1D4*5点影响。对交涉系技能也可能也造成影响[(失去的APP)]。","酒豪:不易喝醉。酒精作为毒素处理的情况下, POT值只有他人的一半。","鹰眼:[侦察]增加[2D3*5]%。","敌人(D):有对调查员不利的敌人存在,投掷一个D100来决定敌人的力量/数量,数值越大越恶劣。用途不限。","擅长武器:火器类射程+50%。近战类武器成功率+5%或者伤害增加1D2。并且武器不易被破坏(具有更多的耐久度),或者入手的武器具有比一般的武器更高的品质。","传家宝:调查员拥有绘画,书籍,武器,家具等具有高价值的宝物。也可能是模组中追加的宝物的持有人。","俊足:DEX+1*5。再投掷一个D6,1~4时MOVE+1,5~6时MOVE+2。","赌徒(D?):进行一次[幸运]鉴定。成功的话调查员获得[(INT+POW)*2/5]%的[赌博]技能。失败的话只有[INT或者POW*0.2]%的技能值,信用减少调查员原信用评级的[1D6*10]%,并且调查员遇到赌博时需要通过一个SAN CHECK才能克制自己。","擅长料理:获得 [(INT或者EDU)]%的[手艺(料理)]技能。","听力良好:[聆听]+[2D3*5]%。","洞察人心:[心理学]+ [2D3*5]%。","反应灵敏:投掷1D6。1~3=DEX+1*5,4~5=DEX+2*5,6=DEX+3*5。","驱使动物:技能和动物有关时获得[(1D6+1)*5]的加值,例如骑马,驾驶马车,特定情况的藏匿,潜行等。","没有特征但是可以选择任意技能(可多选)获得总计3D20点技能加值。","玩家自己选择一个特征。"},
										{"再投掷三次,玩家和KP各选择一个。","贪婪(D):对调查员来说金钱至上。任何状况下都优先考虑金钱。为此欺骗他人也是正常的,欺骗对象也包含其他调查员。","悲叹人生:SAN-1D10,玩家和KP给调查员设定一个背景(失去爱人,子孙或者其他血亲的悲剧)。","憎恶(D):玩家和KP商议决定,调查员对于特定的国籍,人种或者宗教具有无理由的反感。调查员接触此类人群时会表现出敌意。","比马还要健壮:CON+1D3*5。","快乐主义者:追求个人的喜悦(美食,饮品,性,衣装,音乐,家具等)。为此浪费了调查员现有信用评级的[(1D4+2)*10]%的信用评级。通过一个[幸运]鉴定,失败的话因为这种放纵的生活而失去5点STR,CON,INT,POW,DEX或者APP。","骑手:[骑马]技能+[(1D6+1)*10]%。","易冲动(D):有不考虑后果轻率的行动的倾向。根据情况可能需要通过一个减半的[灵感]鉴定来使头脑冷静。","巧妙:二选一。A)[灵感]+10%,获得可以临时组装或者发明一些装置的能力。B)武器以外的操纵系技能获得加值,只选择一个技能的话+30%,选择2个技能各+20%,3个各+10%。","疯狂(D):SAN-1D8。玩家和KP商议给予调查员一个精神障碍。","土地勘测员:调查员对某一篇地域了解的非常详细(例:建筑配置,道路,商业,住民,历史等)。对应的区域应为都市某一块区域或者单个农村之类的较狭小的范围。对于这篇区域的详细情况调查员通过[教育]或者[灵感]鉴定即可知晓。","意志顽强:POW+1D3*5,san也获得对应的上升。","花花公子:APP+1D3*5,和异性交往有关的交涉技能+[1D3*10]%。","持有高额财产:调查员拥有某种具有巨大价值的东西(例:船只,工厂,房屋,矿山,大块的土地等)。这些东西可能需要调查员花费很大的时间和精力在这里，玩家和KP要慎重的决定。","语言学家:调查员即使语言不通也有可能和对象成功的交流,增加一个辅助技能[语言学家],初期技能值为[INT或者EDU]*0.2%。","家人失踪:调查员有着失踪很久的家人,有可能会在模组中登场(例:兄弟/姐妹/或者其他亲人遭遇海难,死在海外,被其他亲戚带走等情况)。","忠诚:调查员不会抛弃自己的家人,朋友,伙伴,在力所能及的范围内一定会帮助他们。这种性格也使他和自己周围的人群交涉时获得10%的加值。","魔术素质:学习咒文时只需要正常的一半时间,成功率也增加[INT*0.2]%。","虽然没有特侦但是职业技能值获得额外的3D20的技能点。","玩家自己选择一个特征。"},
										{"虽然没有特征,但是调查员的持有现金为通常规则的2倍。","魔术道具:KP可以给予调查员一个魔术道具(可以杀伤神话生物的附魔武器,召唤神话生物的专用道具,占卜用品,POW储藏器等等)。调查员如果想要知道这件道具的详细性质需要通过一个[POW*0.2]的鉴定。","射击名人(手枪,步枪以及霰弹枪中选择一项):选择的这项火器技能+[2D3*5]%。","认错人:调查员被频繁的被误认为其他人,通常都会是些有着恶评的人物(罪犯,身怀丑闻的恶人之类的)。模组中在合适的情况下[幸运]可能会被降为原本的一半(简单来说,调查员因为某些理由获得其他人的犯罪历史,恶名,通过诈骗获得的财富或者权力这样的身份或者特征)。","天气预报:通过一个[灵感]鉴定调查员就可以得知[1D6+1]小时里的正确天气情况。有多大的降雨量,下雨的场所,风级,持续时间等等。","对外观的强迫观念(D):APP+5,但是调查员为了让自己看起来亮丽动人而花费大量的金钱来购买华贵的服饰和饰物。信用评级减半。","古书:调查员拥有和模组有关的重要书籍资料或者它的复印(例:杂志,黑魔术书籍,历史书,圣经,神话魔导书,地图等等)。KP可以决定这件道具的性质和价值。","试炼生还者:SAN-1D6。调查员拥有从恐怖环境中生还的经验(海难,战争,恐怖分子劫持,地震等等)。因为这个经历可能给调查员带来某种长久的影响(通常程度的恐怖症状,或者其他的精神障碍等)。","孤儿:调查员相依为命的家人都不在了,或者不知道自己真正的家人是谁。","其他语言:调查员可以追加获得一项其他语言技能。技能值为[1D4*INT*0.2]%。","野外活动爱好者:[导航],[自然史],[追踪]各增加[(2D3+1)*5]%(分别投掷)。","寄托爱意:模组中登场的某位角色对调查员怀有憧憬。由KP决定是哪位角色,为什么以及怀有何种程度。","身怀爱意(D):调查员对其他角色怀有憧憬。由KP决定喜欢谁,为什么以及何种程度。","麻痹(D):调查员因精神,疾病等原因苦于身体抽搐,扭曲等症状。各鉴定一次[幸运],失败的话减少1D2*5点DEX和5点APP。","超常现象经历:调查员曾经经历过难以说明的遭遇(幽灵,黑魔术,神话生物,超能力等)。玩家和KP讨论决定其内容并失去最多1D6点SAN值。","大肚子(D):这位调查员怎么说也太胖了点。鉴定一次[幸运],失败的话投掷一个D6,1~3 CON-5,4~6 APP-5。","说服力:[劝说]+[(2D3+1)*5]%。","宠物:调查员有养狗,猫或者鸟类。","虽然没有特征但是任意技能获得3D20点技能点。","再投掷一次,获得那个特征:特征具有(D)时,玩家可以再额外选择一个其他任意特征获得。特征没有(D)时,玩家必须再同时选择一个(D)特征。"},
										{"虽然没有特征但是职业技能值额外获得3D20点技能点。","恐怖症/疯狂(D):调查员身患恐怖症状或者疯狂症状。参考6/7版标准规则随机决定症状,或者选择想要的症状。遭遇到自身症状根源的恐怖或者物品时,如果SAN CHECK失败,那么调查员将无法抑制自己的恐怖或者被魅惑。","权力/阶级/企业地位:调查员在政治,经济或者甚至军事环境里持有某种程度的权力。投掷D100,出点越大权力越大。企业地位影响融资,政治地位可能所属某种政府机关,军队地位远超本身拥有的军衔也说不定。[信用+25%。详细的情况和KP商议决定。","以前的经验:玩家可以选择获得[(INT或者EDU)]%的职业技能点数。","预知梦:由KP决定,游戏中玩家会做一个预言未来的梦。这大概会需要一个[POW*3*0.2]的鉴定。梦境没有必须符合现实的必要,如果梦境中见到的景象十分恐怖的话那么会失去一些SAN值(现实中见到相同景象失去SAN值的10%左右)。鉴定失败的话玩家会获得错误的预言。","繁荣:调查员的年收入和资产变成2倍。[信用]增加[1D4*5]%。调查员的事业很成功,或者调查员给富翁,持有权力的人做事或者与他们共事。","心理测量:接触某些物体时(或者抵达某个地方时),通过一个POW*0.2的鉴定,成功的话可以窥视到这个物品/地方的过去。这个能力的正确度由KP决定。这个能力消耗1D6点MP。因为幻觉也可能失去SAN值(和上述的”预知梦”类似,损失通常的10%左右)。","健谈者:[话术]+[2D4*5]%。调查员有着非常厉害的语言术,可以通过讲故事获得朋友的信任,降低敌人的敌意,赚到一顿免费的餐点也是可能的。","罕见的技能:调查员通过一个[INT*0.8]%的鉴定的话,可能会持有一些生活中完全不常见,或者一般来说不会有的技能。罕见的语言,格斗技,驾驶热气球之类,和KP商议决定。","红发:调查员有着一头好像燃烧着一般的红发,非常显眼(没有其他效果)。","评价(D?):鉴定一次[幸运]。成功的话调查员被人尊敬(设定其理由),调查员在自家所在的村子/都市中所有的交涉系技能获得15%的加值。[幸运]失败的话调查员获得极坏的评价,所有的交涉系技能-15%。KP也可以决定通过良好的业绩来抵消这个恶评。","报复追求者:调查员相信自己受到了不公正的待遇并且对导致自己受到这种恶意的对象进行报复行为。玩家和KP讨论决定敌人的真身。投掷一个D100来决定敌人的强度和调查员受到这种不公正的程度。","伤痕:鉴定一次[幸运]。成功的话伤痕没有影响调查员的外观,甚至彰显其英勇也说不定。失败的话失去1D3*5点APP,交涉系技能也减少[1D3*5]%。","科学的精神:[灵感]+5%。并且选择一个思考类技能+30%或选择2个思考系技能+20%或者所有其他思考系技能+10%。","秘密(D?):调查员有着决不能告诉别人的秘密。调查员的邻居可能会有些线索也说不定。调查员可能是个罪犯,间谍,或者卖国贼之类的也说不定。内容由玩家和KP商议决定。","秘密结社:调查员所属于秘密主义的团体,可能会是共济会,蔷薇十字团,神志主义者,炼金术师结社,光明会之类团体的一员。或者是地下医学研究者之类的犯罪/阴谋组织的一员。","自学:EDU+1D3*5,并增加因此获得的技能值。","可疑的过去/绯闻(D):调查员过去曾经做过一些惹人怀疑的事情(卖淫,偷人等),或者曾经犯下过某些重大罪行。所有的交涉系技能减少[1D3*10]%。","再投掷一次,获得那个特征:特征具有(D)时,玩家可以再额外选择一个其他任意特征获得。特征没有(D)时,玩家必须再同时选择一个(D)特征。","再投掷两次并获得那两个特征。"},
										{"投掷三次,玩家和KP各选择一个特征。","病弱(D):CON-1D3*5。","巧妙的手法:[钳工]技能增加[DEX]%,可以在偷窃或者魔术的时候使用。","迟缓(D):MOVE-1。","失去名誉(D):探索者因为国籍,性别,人种,宗教或者过去的犯罪记录等原因失去了社会上的名誉地位。作为其影响,调查员可能减少自由活动时间甚至所有的交涉系技能减少[1D4*10]%甚至更多。具体的影响玩家和KP商议决定。","原军人:调查员获得[INT]点的技能点加到士兵的职业技能上。","咒文知识:由KP决定!调查员最多可以获知1D3种咒文。SAN值减少1D6点。","胆小(D):调查员见到血液或者流血就会感觉到身体不适,失去更多的SAN值。也可能因为疾病的原因无法靠近或通过流血现场。","坚毅:调查员不受到现实中的血迹或者流血的影响。遭遇血迹和流血时SAN损失为最小值,即使见到最残虐的场合(大量被撕裂的人,被猎奇杀死的尸体等)也最多只减少通常的一半。","比公牛还要强韧:STR+1D3*5。","迷信(D):调查员迷信不疑,依赖着护身符,仪式或者愚蠢的信念。遭遇超自然现象的时候比通常多损失1点SAN值,即使原本不损失的情况下可能变成损失1点。","同情心:调查员选择一个交涉系技能+30%或者选择两个各+20%,然后额外再选择一个+10%。","意外的帮手:调查员因为一些缘由拥有一个对自己忠实并帮助自己的协助者。KP来决定这个协助者的真身和影响(依旧可以D100来决定)。并且D100也决定其频率。","看不见的财产:调查员有一笔自己不知道的财产。这可能是亲人遗赠的或者理事会之类授予的。这可能会是一块土地,房屋或者事业。这依旧可以用D100来决定去价值程度。","虚弱(D):STR-1D3*5。","戴眼镜(D):调查员要看清东西必须戴眼镜。鉴定一个[幸运],成功的话眼镜只在读书或者进行精细工作的时候才需要。失败的话会在激烈运动等情况时会感觉到不能自由行动。不戴眼镜的话和视觉关联的技能减少[1D3*10]%(这个惩罚即使幸运成功也一样)。","彬彬有礼:调查员的[信用]+10%,真是个有礼貌的绅士(淑女)。","孩子(D):调查员的年龄变成[10+2D3]岁。最大EDU变成[年龄的1/2+2],DEX+5,STR,CON,APP中任意一项+5。玩家和KP商议决定,调查员大概依旧和家人住在一起,职业等也需要重新修正。","任意选择一项特征。","投掷两次,玩家任意选择其中一项特征。"}};
	RD rdGasOne("1D6");
	rdGasOne.Roll();
	RD rdGasTow("1D20");
	rdGasTow.Roll();
	strGAS += GasString[rdGasOne.intTotal - 1][rdGasTow.intTotal - 1];
}


inline void TZ(string &strTZ)
{
	strTZ += "  自动生成玩家自定义特质:\n";
	string TZString[8][20] = {{"害怕夜晚(D):你因为某些原因害怕夜晚,深夜12点以后还要活动的话,“IDEA”和“知识”判定的成功范围变为各自的2分之1。但是擅长早起", "快速恢复:你的恢复能力比一般人要强,生命力的回复判定结果+1", "容易招怪物的喜爱。如果被怪物带走了的话,不会被杀,而是会被监禁或是更糟糕。", "你的感官十分敏锐,容易发现他人的弱点,贯穿的几率不是通常的5分之1,而是2分之1,但最大为40%。", "你这个人有点不可思议,也许从别的世界来的精神交换者或是妄想延伸出来的人格会渐渐显形", "你的生命力犹如小强,濒死5回合之后才会死", "大多数动物只要看到探索者就会进行恐吓,甚至袭击过来", "你的攻击非常有力,造成的伤害比一般要高,伤害加值上升一段(-1D4变成0,0变成+1D4)。但伤害加值是1D6或以上的时候,不上升一段而是加值再+1", "任意选择一个特性", "你有特殊的投掷技巧,总是可以命中要害,<投掷>时的武器伤害加值不是2分之一,而是适用通常的伤害加值。", "你是一个完完全全的路痴,“导航”基本成功率变更为1%,且无法通过经验判定获得成长", "你的运气非常好,经常被神话生物忽略,当神格或神话生物随机指定攻击目标时,你被排除在外。单挑或遇到范围攻击时不适用。", "你的长相十分凶恶,这使你容易被人怀疑,APP-5,使用[信用]时有10的减值。", "你擅长潜水,对窒息的CON判定的成功范围+20", "调查员的年龄变成[10+2D3]岁。最大EDU变成[年龄的(1/2+2)*5],DEX+1,STR,CON,APP中任意一项+1。玩家和KP商议决定,调查员大概依旧和家人住在一起,职业如果不是学生的话默认为未来想要做的工作。", "你对毒物的抗性比较高,骰毒物(POT)抵抗表时,成功范围+20", "调查员要看清东西必须戴眼镜。鉴定一个[幸运],成功的话眼镜只在读书或者进行精细工作的时候才需要。失败的话会在激烈运动等情况时会感觉到不能自由行动。不戴眼镜的话和视觉关联的技能减少[1D3*10]%(这个惩罚即使幸运成功也一样)。", "发疯后,探索者特有的感性可以看穿隐藏在恐怖身后的真相。KP必须告知其黑幕的正体,但是不许告知他人。", "调查员是个迷信的人,依赖着护身符,仪式或者愚蠢的信念。遭遇超自然现象的时候比通常多损失1点SAN值,即使原本不损失的情况下可能变成损失1点。", "重新投掷一次,如果是(D)的特性就再任意选择一个不带(D)的特性获得,如果说是不带(D)的特性,那么就任意选择一个带(D)特性获得。"},
							   {"调查员见到血液或者流血就会感觉到身体不适,失去更多的SAN值。也可能因为疾病的原因无法靠近或通过流血现场。", "你受到动物的喜爱，大多数动物会跟探索者亲近", "探索者因为国籍,性别,人种,宗教或者过去的犯罪记录等原因失去了社会上的名誉地位。作为其影响,调查员可能减少自由活动时间甚至所有的交涉系技能减少[1D4*10]}甚至更多。具体的影响玩家和KP商议决定。", "你是天生的战士，可以把周围的一切都当做武器。所有格斗系技能的基本成功率变更为50", "重新投掷三次，自己选择一个，再由KP选择一个", "你的躲闪技术十分好，(回避)的基本成功率变为(DEX的数值)", "你天生就经常生病，CON-1D3*5", "你在使用火器方面十分有天赋，火器系技能的基本成功率变更为50", "调查员过去曾经做过一些惹人怀疑的事情(卖淫,偷人等),或者曾经犯下过某些重大罪行。所有的交涉系技能减少[（1D3-1）*10]}。", "由KP选择两个带（D）的特性给予角色", "你因为一些原因拥有伤疤，鉴定一次[幸运]。成功的话伤痕没有影响调查员的外观,甚至彰显其英勇也说不定。失败的话失去1D3*5点APP,交涉系（除了恐吓）技能减少[1D3*5]。", "你的外表十分平凡，(乔装)+20}。如果技能失败但是对方只见过你一回时，并且对方没有通过(IDEA)判定的话，你可以用(我大众脸)的借口，让对方以为没见过你。", "调查员因为被人厌恶(设定其理由),调查员在自家所在的村子/都市中所有的交涉系技能-15}，KP也可以决定通过良好的表现来抵消掉这个恶评。", "你是一个娇生惯养的人，这让你的体质有所上升，但是由于其他人替你料理事物导致你思考能力较差，INT-5，CON+10", "重新投掷三次，选择获得其中一个特性", "你的体型有点大，SIZ+5", "调查员身患恐怖症状或者疯狂症状。参考7版标准规则随机决定症状，当做永久的不定狂气处理。遭遇到自身症状根源的恐怖或者物品时,如果SAN CHECK失败,那么那个症状会直接爆发。", "你的脑子转得比其他人要快，INT+5", "这位调查员怎么说也太胖了点。鉴定一次[幸运],失败的话投掷一个D6,1~3 CON-5,4~6 APP-5。", "没有特性，但是获得3D3*10的兴趣点"},
							   {"任意选择一个特性", "你拥有一个幸运的护身符，当这个护身符在身上的时候Luck+5，如果没带在身边就会招来不幸Luck-5。", "调查员因精神,疾病等原因苦于身体抽搐,扭曲等症状。鉴定一次[幸运],失败的话减少1D2*5点DEX和5点APP。", "探索者拥有一位对自己尽忠、也许会前来救援的协助者。KP决定协助者是谁，D100决定协助者的影响力，但是协助者的数据由KP提供", "调查员对其他角色怀有憧憬。由KP决定喜欢谁,为什么以及何种程度。", "一出生就不受人注目，[潜行]+20", "你的因为某些原因导致力气没有其他人大，STR-1D3*5", "你热衷于收藏图书，甚至自己拥有一个图书室，在需要查询资料时过一个[幸运]检定，如果成功你便可以在你的图书室里面找到相关资料，当然，找书时还需要一个[图书馆]的检定", "重新投掷两次，得到那两个特性", "你是有名的人的孩子，在使用[信用]时有20的加值", "APP+5，但是调查员为了让自己看起来亮丽动人而花费大量的金钱来购买华贵的服饰和饰物。储蓄和资产减半。", "调查员曾经经历过难以说明的遭遇(幽灵,黑魔术,神话生物,超能力等)。玩家和KP讨论决定其内容并失去最多1D6点SAN值，因为这个经历可能给调查员带来某种长久的影响(通常程度的恐怖症状,或者其他的精神障碍等)，所以如果出点为6，则获得一项永久的精神障碍（玩家和KP商议决定，可以从疯狂表里面挑），克苏鲁神话增加1D5。", "你因为某些原因习得了一些罕见的技能，挑选一个罕见技能，这个技能获得INT一半的加值", "你的移动速度比别人慢，MOVE-1", "你善于从失败当中吸取经验，技能判定中骰出“96”或以上骰目，并“失败”的话，立即进行特别的经验判定，失败的话0点，成功则获得1点技能成长", "你是一个害羞的人，对陌生人或者不熟的人使用的“话术”、“说服”有10的减值", "调查员有着罕见的发色,非常显眼，在有人的地方时，[潜行]的成功率下降一半", "你在学习方面十分努力，EDU+5。", "你调查员拥有从恐怖环境中生还的经验(海难,战争,恐怖分子劫持,地震等等)。因为这个经历可能给调查员带来某种长久的影响(通常程度的恐怖症状,或者其他的精神障碍等)，所以SAN-1D6，如果出点为6，则获得一项永久的精神障碍（玩家和KP商议决定，可以从疯狂表里面挑）。可以选择任意一个技能获得一次成长，选择的技能需要有合理的理由。", "重新投掷一次，如果是（D）的特性就再任意选择一个不带（D）的特性获得，如果说是不带（D）的特性，那么就任意选择一个带（D）特性获得。"},
							   {"由玩家和KP商议决定,调查员由于特定的国籍,人种或者宗教的原因受到他人歧视，其他人接触这位调查员时会表现出敌意", "调查员在某些方面手法十分高明，选择[锁匠][妙手]其中一项技能增加[DEX/5]。", "由玩家和KP商议决定,调查员对于特定的国籍,人种或者宗教具有无理由的反感。调查员接触此类人群时会表现出敌意。", "你曾今自学过一段时间，调查员获得一个教育成长的机会。", "重新投掷三次，自己选择一个，再由KP选择一个", "调查员所属于秘密主义的团体,可能会是共济会,蔷薇十字团,神志主义者,炼金术师结社,光明会之类团体的一员。或者是地下医学研究者之类的犯罪/阴谋组织的一员。", "对调查员来说金钱至上。任何状况下都优先考虑金钱。为此欺骗他人也是正常的,欺骗对象也包含其他调查员，他们可能会被收买而反水。", "调查员曾经更换过职业，获得“EDU的数值”的点数，加到玩家决定的前职业的职业技能上", "你是一个过度追求个人的喜悦(美食,饮品,性,衣装,音乐,家具等)的人。为此浪费了[(1D4+2)*10]}的资产。通过一个[幸运]鉴定,失败的话因为这种放纵的生活而失去5点STR,CON,INT,POW,DEX或者APP。", "由KP选择两个带（D）的特性给予角色", "你因为某些原因会使用魔法，由KP决定，调查员最多可以获知1D3种咒文。SAN值减少1D6点。", "调查员被频繁的被误认为其他人,在这个特性的情况下通常都会是些有着恶评的人物(罪犯,身怀丑闻的恶人之类的)。模组中在合适的情况下[幸运]与[信誉]可能会被降为原本的一半", "调查员真是个有礼貌的绅士(淑女)，使用[信用]时有10的加值。", "这位调查员十分强壮，甚至公牛还要强壮，STR+1D3*5", "重新投掷三次，选择获得其中一个特性", "因为性格原因，你十分冲动，有不考虑后果轻率的行动的倾向，根据情况可能需要通过一个减半的[灵感]鉴定来使头脑冷静，否则就会直接行动。", "调查员不受到现实中的血迹或者流血的影响。遭遇血迹和流血时SAN损失为最小值,即使见到最残虐的场合(大量被撕裂的人,被猎奇杀死的尸体等)也最多只减少通常的一半", "你因为某些经历拥有精神疾病，SAN-1D8。玩家和KP商议给予调查员一个精神障碍（可以从疯狂表里面挑）。", "你的人生十分悲惨，SAN-1D10,玩家和KP必须给调查员设定一个悲惨背景，比如失去爱人,子孙或者其他血亲的悲剧，重要之人可以根据情况填写已故之人。", "没有特性，但是获得3D3*10的兴趣点"},
							   {"任意选择一个特性", "调查员在政治,经济或者甚至军事环境里持有某种程度的权力。选择一个领域，投掷D100,信用评级变更为那个数值，但是如果超过职业允许上限的话则无法添加技能点。企业地位影响融资,政治地位可能所属某种政府机关,军队地位远超本身拥有的军衔也说不定。详细的情况和KP商议决定。", "调查员被吉普赛人,魔女,法师,外国原住民等施予了诅咒,诅咒效果由KP决定。KP也可以决定解除诅咒的条件。", "你说话很有说服力，[说服]+[(1D3+1)*5]。", "你因为某些事件失去了身体的一部分。投掷一个D6。1~2=脚,3~4=手,5=头部(投掷D6,1~3=眼睛,4~6=耳朵),6=玩家自己选择。失去脚的话DEX-15，STR或者CON-5,MOVE只有常人的一半,所有运动系技能以及运动相关检定-25。失去手腕的话STR-5,DEX-10,所有需要用到手的检定-15,使用武器时会受到限制。失去眼睛的话[侦察]和火器相关技能等全部-35},另外还要投掷一个[幸运],失败的话APP-[1D2*5]。失去耳朵的话APP-[1D3*5],[聆听]等和耳朵有关的技能全部-30。", "你的耳朵有点不好使，[聆听]成功率减少[1D4*5]。", "你的事业很成功,或者调查员给富翁,持有权力的人做事或者与他们共事，[信用评级]增加[1D4*5]", "你身患绝症[癌症,失明,梅毒,结核等],绝症对调查员造成恶劣影响,至少也失去了10点CON,如果病情继续恶化的话还会继续失去其他能力值（PL与KP商议决定）。投掷一个1D10*D100来决定剩余寿命（天为单位）,出点越大寿命越长。", "重新投掷两次，得到那两个特性", "你拥有超能力，接触某些物体时(或者抵达某个地方时),通过一个POW/2的鉴定,成功的话可以窥视到这个物品/地方的过去。这个能力的正确度由KP决定。这个能力消耗1D6点MP。因为幻觉也可能失去SAN值(和上述的”预知梦”类似,损失通常的10}左右)。", "你如同卡西莫多一样具有巨大的伤痕或者身体变形等特征,对APP造成至少减少1D4*5点影响。对交涉系技能也可能也造成影响[(失去的APP)的数值]。", "调查员有着非常厉害的语言术,可以通过讲故事获得朋友的信任,降低敌人的敌意,赚到一顿免费的餐点也是可能的，[话术]+[1D3*5]}。", "因为某些原因调查员相信自己受到了不公正的待遇并且对导致自己受到这种恶意的对象进行报复行为。玩家和KP讨论决定敌人的真身。投掷一个D100来决定敌人的强度和调查员受到这种不公正的程度，这个敌人的数据由KP提供。", "调查员因为某些原因被人尊敬(设定其理由),调查员在自家所在的村子/都市中所有的交涉系技能获得15}的加值。", "因为某些原因，在模组中存在你的敌人或者仇人,投掷一个D100来决定敌人的力量/数量,数值越大这个敌人越强悍。用途不限，但是人物数据由KP决定。", "你拥有科学精神，[灵感]+5}。并且可以在[科学]技能的分野之中选择一个技能+20或者选择2个技能+10或者三个技能+5。", "你是一个不折不扣的赌徒，你需要进行一次[幸运]鉴定。成功的话调查员获得50基础值的[赌博]技能。失败的话只有20的基础技能值,资产减少[1D6*10]},并且调查员遇到赌博时需要通过一个SAN CHECK才能克制自己。", "调查员有着决不能告诉别人的秘密，内容由玩家和KP商议决定。", "对调查员来说金钱至上。任何状况下都优先考虑金钱。为此欺骗他人也是正常的,欺骗对象也包含其他调查员，他们可能会被收买而反水。", "重新投掷一次，如果是（D）的特性就再任意选择一个不带（D）的特性获得，如果说是不带（D）的特性，那么就任意选择一个带（D）特性获得。"},
							   {"你因为各种原因持有着某种魔术道具，KP可以给予调查员一个魔术道具(可以杀伤神话生物的附魔武器,召唤神话生物的专用道具,占卜用品,POW储藏器等等)。调查员如果想要知道这件道具的详细性质需要通过一个[POW/2]的鉴定。", "调查员不会抛弃自己的家人,朋友,伙伴,在力所能及的范围内一定会帮助他们。这种性格也使他和自己熟系的人交涉时获得10的加值。", "你的一些经历让你十分厌恶动物，在使用与动物有关的技能时，技能成功率减少[1D6*5]", "你因为某些原因使得射击技术十分优秀，选择一项火器技能+[2D3*5]。", "重新投掷三次，自己选择一个，再由KP选择一个", "调查员被频繁的被误认为其他人,在这个特性的情况下通常都会是些有着好评的人物(有钱人人，大人物什么的)。模组中在合适的情况下[幸运]与[信誉]可能会有加值", "你嗜酒如命，经常大量饮酒对你的身体产生了危害，CON-5。并且还要从STR,DEX,POW,APP中任意一项减少5点。每隔一段时间需要一个意志检定来抑制喝酒的想法，而且当饮酒过多陷入酩酊大醉需要通过一个SAN CHECK。陷入疯狂的情况下,调查员可能会寻求酒精来逃避现实。", "你有在海外生活过一段时间的经历，获得“EDU的数值”}点数，加到最多3个“其他语言”技能上", "调查员可以追加获得一项其他语言技能。技能值为[1D4*INT]}", "由KP选择两个带（D）的特性给予角色", "这个人年龄有点大，年龄下限变为[(1D3+2)*10]岁，只能取这个年龄以上的年龄，相关的教育增长以及数值下降要记得进行计算", "调查员相依为命的家人都不在了,或者不知道自己真正的家人是谁，背景里面的重要之人可以不填。", "STR,CON,SIZ,DEX,POW,APP中的任意一项减少15点。在明亮阳光下时[侦察]技能值减少[(1D4-1)*5]点,长时间受到光照的话会受到1点以上的HP伤害（这个由KP裁决时间）。白化病人在人群中很显眼，所以在有人的地方进行潜行检定时成功率下降15，并可能被他人用有色目光看待，[话术]与[说服]成功率下降[(1D3+1)*10]。", "模组中登场的某位角色对调查员怀有憧憬。由KP决定是哪位角色,为什么以及怀有何种程度。", "重新投掷三次，选择获得其中一个特性", "调查员拥有和模组有关的重要书籍资料或者它的复印(例:杂志,黑魔术书籍,历史书,圣经,神话魔导书,地图等等)。KP可以决定这件道具的性质和价值。", "你拥有观察周围的情况来判断接下来的天气的能力，通过一个[灵感]鉴定调查员就可以得知[1D6+1]小时里的正确天气情况。有多大的降雨量,下雨的场所,风级,持续时间等等。", "你十分喜欢荒野求生等野外活动，[领航],[博物史],[追踪]各增加[(1D3+1)*5](分别投掷)。", "你做事十分笨拙，甚至因此经常把事情弄黄，大失败的几率变成通常的2倍。", "没有特性，但是获得3D3*10的兴趣点"},
							   {"重新投掷一次，如果是（D）的特性就再任意选择一个不带（D）的特性获得，如果说是不带（D）的特性，那么就任意选择一个带（D）特性获得。", "你拥有成为魔法师的资质，学习咒文时只需要正常的一半时间,成功率也变更为[INT的数值]。", "你经常锻炼，对某些运动比较擅长，可以在[攀爬][跳跃][游泳]之中挑选一项技能成长20，或者是两项成长10，或者是三项成长5，这三个技能以外的运动相关检定成功率上升[1D3*5]", "调查员可以灵活的使用他的任意一只手而不会受到非惯用手的惩罚（暗示双持）。", "你天生在艺术方面很有天赋，[书法][美术][文学][音乐]的基础值变更为50", "你的意志比常人要坚韧，POW+1D3*5,san也获得对应的上升。", "你因为身份或者职业等原因学习过骑马，[骑术]技能+[(1D6+1)*10]}。", "你做的梦有时能够预知未来，由KP决定,游戏中玩家会做一个预言未来的梦。这大概会需要一个[POW/2]的鉴定。梦境没有必须符合现实的必要,如果梦境中见到的景象十分恐怖的话那么会失去一些SAN值(现实中见到相同景象失去SAN值的10}左右)。鉴定失败的话玩家会获得错误的预言。", "调查员具有邪恶的一族,外国人,食人族,甚至神话生物的血统。投掷一个D100,出点越大,血统也越可怖。", "任意选择一个特性", "你拥有一位同盟者，他（她）可能是你的同事，家人或者朋友，投掷一个D100来决定同盟者的力量和出现的频率(D100的出点越大可能能够获得越强大的同盟者)，用途不限，但是同盟者的数据由KP提供。", "对四周一直保持警戒，一直都保持着能够随时[侦察]或者[聆听]的状态，可以在本人认为必要的情况下使用[侦察]或者[聆听]（注：一定要合理使用哦~）。", "良好的生活心态让你感觉自己老得慢，40岁开始对身体能力造成减值的规则改为从50岁开始。", "你拥有与动物对话的能力，可以申请得到某种动物的语言（比如说猫语，鸟语什么的），基础值为25", "调查员有养狗,猫或者鸟类，在游戏中可以驱使他们去完成某些任务，并且在游戏的一段故事结束后，可以通过相互互动，回复理智度1D3点。但是不能超过能力值SAN或最大理智度点数，如果宠物死去，SC1D5/2D5。", "你的思路清奇，十分巧妙，拥有该特性的调查员可以从以下效果二选一。A)[灵感]+10},获得可以临时组装或者发明一些装置的能力。B)从[机械维修][操作重型机械][电气维修][锁匠]之中挑选技能获得加值,只选择一个技能的话+20},选择2个技能各+10},3个各+5}。", "调查员对某一片地域了解的非常详细(例:建筑配置,道路,商业,住民,历史等)。对应的区域应为都市某一块区域或者单个农村之类的较狭小的范围。对于这篇区域的详细情况调查员通过[知识]或者[灵感]鉴定即可知晓。", "APP+1D3*5,和异性交往有关时交涉技能+[1D3*10]}。", "你在空闲之余有研究语言或者你本身就在做相关的职业，即使语言不通的情况下也有可能和对象成功的交流,增加一个辅助技能[语言学家],初期技能值为[INT或者EDU/2]。", "重新投掷两次，得到那两个特性"},
							   {"你的身体倍棒，CON+1D3*5。", "你十分擅长驱使动物去做事，与驱使动物有关的技能时增加[(1D4+1)*5]", "你的身手比其他人好，投掷1D6。1~3=DEX+5,4~5=DEX+10,6=DEX+15。", "你擅长揣摩他人心思，[心理学]+ [1D3+1*5]。", "重新投掷三次，自己选择一个，再由KP选择一个", "你的听力十分好[聆听]+[1D3+1*5]。", "你很擅长做料理，[手艺(料理)]技能的基础值变更为50。", "你跑的很快，DEX+5。再投掷一个D6,1~4时MOVE+1,5~6时MOVE+2。", "你拥有一件祖传的宝物，这些东西也可能是绘画,书籍,武器,家具等具有高价值的物品，甚至可能是某些魔法道具或者法术书，投掷一个1D100决定该物品的价值。", "由KP选择两个带（D）的特性给予角色", "你因为身份或者职业等原因擅长使用武器，火器系技能或者近战系技能+10。", "[侦察]技能增加[1D3+1*5]。", "不易喝醉。酒精作为毒素处理的情况下, POT值只有他人的一半。", "调查员有收集硬币,书,昆虫,艺术作品,宝石,古董之类的爱好，任选一种收集物。并且你在该收集方面很有名，你可以通过<幸运>判定的话，如果成功，对方的兴趣默认与你相同（只要设定没有给就可以这样子设定）。", "重新投掷三次，选择获得其中一个特性", "你因为某些因素比较擅长打架，[斗殴]技能上升[1D4*5]},每回合可以进行两次[斗殴],斗殴伤害变更为1D4。", "你做事具有领导风范，这种特性让你的意志比常人坚定，POW+[1D2*5],并且交涉系技能+[1D3*5]}。", "在黑暗环境下的视觉相关惩罚只有常人的一半。", "调查员有着失踪很久的家人,有可能会在模组作为NPC中登场，在导入时投一个1D4，如果出点为4时就会登场，不过需要PL本人提交人物卡(例:兄弟/姐妹/或者其他亲人遭遇海难,死在海外,被其他亲戚带走等情况)。", "没有特性，但是获得3D3*10的兴趣点"}};

	RD rdTZOne("1D8");
	rdTZOne.Roll();
	RD rdTZTow("1D20");
	rdTZTow.Roll();
	strTZ += TZString[rdTZOne.intTotal - 1][rdTZTow.intTotal - 1];
}

inline void COC6(string &strMAns, int intNum)
{
	strMAns += "的人物作成:";
	string strProperty[] = {"力量", "体质", "体型", "敏捷", "外貌", "智力", "意志", "教育"};
	string strRoll[] = {"3D6", "3D6", "2D6+6", "3D6", "3D6", "2D6+6", "3D6", "3D6+3"};
	const bool boolAddSpace = intNum != 1;
	int intAllTotal = 0;
	while (intNum--)
	{
		strMAns += '\n';
		for (int i = 0; i != 8; i++)
		{
			RD rdCOC(strRoll[i]);
			rdCOC.Roll();
			strMAns += strProperty[i] + ":" + to_string(rdCOC.intTotal) + " ";
			if (boolAddSpace && rdCOC.intTotal < 10)
				strMAns += "  ";
			intAllTotal += rdCOC.intTotal;
		}
		strMAns += "共计:" + to_string(intAllTotal);
		intAllTotal = 0;
	}
}

inline void DND(string &strOutput, int intNum)
{
	strOutput += "的英雄作成:";
	RD rdDND("4D6K3");
	string strDNDName[6] = {"力量", "体质", "敏捷", "智力", "感知", "魅力"};
	const bool boolAddSpace = intNum != 1;
	int intAllTotal = 0;
	while (intNum--)
	{
		strOutput += "\n";
		for (int i = 0; i <= 5; i++)
		{
			rdDND.Roll();
			strOutput += strDNDName[i] + ":" + to_string(rdDND.intTotal) + " ";
			if (rdDND.intTotal < 10 && boolAddSpace)
				strOutput += "  ";
			intAllTotal += rdDND.intTotal;
		}
		strOutput += "共计:" + to_string(intAllTotal);
		intAllTotal = 0;
	}
}

inline void TempInsane(string &strAns)
{
	const int intSymRes = RandomGenerator::Randint(1, 10);
	std::string strTI = "1D10=" + to_string(intSymRes) + "\n症状: " + TempInsanity[intSymRes];
	if (intSymRes == 9)
	{
		const int intDetailSymRes = RandomGenerator::Randint(1, 100);
		strTI = format(strTI, {"1D10=" + to_string(RandomGenerator::Randint(1, 10)), "1D100=" + to_string(intDetailSymRes), strFear[intDetailSymRes]});
	}
	else if (intSymRes == 10)
	{
		const int intDetailSymRes = RandomGenerator::Randint(1, 100);
		strTI = format(strTI, {"1D10=" + to_string(RandomGenerator::Randint(1, 10)), "1D100=" + to_string(intDetailSymRes), strPanic[intDetailSymRes]});
	}
	else
	{
		strTI = format(strTI, {"1D10=" + to_string(RandomGenerator::Randint(1, 10))});
	}
	strAns += strTI + "\n啊~陷入疯狂了吗？也好也好，这样就不用受苦了。哦，当然这只是暂时的~";
}

inline void LongInsane(string &strAns)
{
	const int intSymRes = RandomGenerator::Randint(1, 10);
	std::string strLI = "1D10=" + to_string(intSymRes) + "\n症状: " + LongInsanity[intSymRes];
	if (intSymRes == 9)
	{
		const int intDetailSymRes = RandomGenerator::Randint(1, 100);
		strLI = format(strLI, {"1D10=" + to_string(RandomGenerator::Randint(1, 10)), "1D100=" + to_string(intDetailSymRes), strFear[intDetailSymRes]});
	}
	else if (intSymRes == 10)
	{
		const int intDetailSymRes = RandomGenerator::Randint(1, 100);
		strLI = format(strLI, {"1D10=" + to_string(RandomGenerator::Randint(1, 10)), "1D100=" + to_string(intDetailSymRes), strPanic[intDetailSymRes]});
	}
	else
	{
		strLI = format(strLI, {"1D10=" + to_string(RandomGenerator::Randint(1, 10))});
	}
	strAns += strLI + "\n那句话怎么说来着？生鱼忧患死鱼安乐（笑）";
}
